import React from "react";
import tw from "twin.macro";

const Specifications = () => {



    return (
        <SpecificationsBlock>
            <Title>
                Условия отпуска
            </Title>
            <TextBlock>
                <Paragraph>свободный</Paragraph>
            </TextBlock>
            <Title>
                Фасовка
            </Title>
            <TextBlock>
                <Paragraph>таблетки</Paragraph>
            </TextBlock>
            <Title>
                Описание
            </Title>
            <TextBlock>
                <Paragraph>Какое-то описаниее продукта</Paragraph>
            </TextBlock>
            <Title>
                Дозировка
            </Title>
            <TextBlock>
                <Paragraph>
                    Внутрь, запивая водой. Взрослым и детям старше
                    12 лет — по 1 табл., но не более 3 табл. в
                    течение 24 ч. Максимальная суточная доза для
                    взрослых — 1200 мг; для детей 12–17 лет — 1000
                    мг. Если при приеме в течение 2–3 дней симптомы
                    сохраняются, следует прекратить прием и
                    обратиться к врачу.
                </Paragraph>
            </TextBlock>
            <Title>
                Лекарственные формы
            </Title>
            <TextBlock>
                <Paragraph>
                    Круглые двояковыпуклые таблетки, покрытые
                    сахарной оболочкой белого цвета с надпечаткой
                    красного цвета «Nurofen 400» на одной стороне
                    таблетки.
                </Paragraph>
            </TextBlock>
            <Title>
                Международное непатентованное название
            </Title>
            <TextBlock>
                Nurofen forte
            </TextBlock>
            <Title>
                Фармакологическое действие
            </Title>
            <TextBlock>
                <ul>
                    <Li>жаропонижающее</Li>
                    <Li>обезболивающее</Li>
                    <Li>противовоспалительное</Li>
                </ul>
            </TextBlock>
            <Title>
                Показание
            </Title>
            <TextBlock>
                <ul>
                    <Li>головная и зубная боль;</Li>
                    <Li>мигрень;</Li>
                    <Li>болезненные менструации;</Li>
                    <Li>невралгия;</Li>
                    <Li>
                        боль в спине, мышечные, ревматические и
                        другие виды боли;
                    </Li>
                    <Li>
                        лихорадочные состояния при гриппе и
                        простудных заболеваниях.
                    </Li>
                </ul>
            </TextBlock>
            <Title>
                Противопоказании
            </Title>
            <TextBlock>
                <ul>
                    <Li>
                        гиперчувствительность к любому из
                        ингредиентов, входящих в состав препарата;
                    </Li>
                    <Li>
                        гиперчувствительность к ацетилсалициловой
                        кислоте или другим НПВС в анамнезе (в т.ч.
                        анамнестические данные о бронхообструкции,
                        рините, крапивнице после приема
                        ацетилсалициловой кислоты или иного НПВС);
                        полный или неполный синдром непереносимости
                        ацетилсалициловой кислоты (риносинусит,
                        крапивница, полипы слизистой носа,
                        бронхиальная астма);
                    </Li>
                    <Li>
                        эрозивно-язвенные заболевания органов
                        желудочно-кишечного тракта в стадии
                        обострения (в т.ч. язвенная болезнь желудка
                        и двенадцатиперстной кишки, болезнь Крона,
                        неспецифический язвенный колит);
                    </Li>
                    <Li>
                        гемофилия и другие нарушения свертываемости
                        крови (в т.ч. гипокоагуляция),
                        геморрагические диатезы;
                    </Li>
                    <Li>
                        период после проведения аортокоронарного
                        шунтирования;
                    </Li>
                    <Li>
                        желудочно-кишечные кровотечения и
                        внутричерепные кровоизлияния;
                    </Li>
                    <Li>
                        выраженная печеночная недостаточность или
                        активное заболевание печени;
                    </Li>
                    <Li>выраженная почечная недостаточность;</Li>
                    <Li>подтвержденная гиперкалиемия;</Li>
                    <Li>беременность;</Li>
                    <Li>детский возраст до 12 лет.</Li>
                </ul>
            </TextBlock>
            <Title>
                С осторожностью
            </Title>
            <TextBlock>
                <Paragraph>
                    пожилой возраст, сердечная недостаточность,
                    артериальная гипертензия, ИБС,
                    цереброваскулярные заболевания, дислипидемия,
                    сахарный диабет, заболевания периферических
                    артерий, цирроз печени с портальной
                    гипертензией, печеночная и/или почечная
                    недостаточность, нефротический синдром,
                    гипербилирубинемия, язвенная болезнь желудка и
                    двенадцатиперстной кишки (в анамнезе), гастрит,
                    энтерит, колит, заболевания крови неясной
                    этиологии (лейкопения и анемия), период
                    лактации, тяжелые соматические заболевания;
                    курение, частое употребление алкоголя;
                    длительное использование НПВС, одновременный
                    прием пероральных ГКС (в т.ч. преднизолона),
                    антикоагулянтов (в т.ч. варфарина),
                    антиагрегантов (в т.ч. ацетилсалициловой
                    кислоты, клопидогрела), селективных ингибиторов
                    обратного захвата серотонина (в т.ч.
                    циталопрама, флуоксетина, пароксетина,
                    сертралина).
                </Paragraph>
            </TextBlock>
            <Title>
                Способ применения
            </Title>
            <TextBlock>
                <Paragraph>
                    Внутрь, запивая водой. Взрослым и детям старше
                    12 лет — по 1 табл., но не более 3 табл. в
                    течение 24 ч. Максимальная суточная доза для
                    взрослых — 1200 мг; для детей 12–17 лет — 1000
                    мг. Если при приеме в течение 2–3 дней симптомы
                    сохраняются, следует прекратить прием и
                    обратиться к врачу.
                </Paragraph>
            </TextBlock>
            <Title>
                Производитель
            </Title>
            <TextBlock
            >
                <Paragraph>Великобритания</Paragraph>
            </TextBlock>
        </SpecificationsBlock>
    );
};

const SpecificationsBlock = tw("div")`
    flex flex-col
`;

const Title = tw("h4")`
    text-base font-bold
    text-gray-800 hover:text-gray-700
    text-left
    font-medium text-sm rounded-md
    mt-1 mb-1
    border-0
`;

const TextBlock = tw("div")`
    text-gray-600
    text-base
    font-light
`;

const Paragraph = tw("p")`
    text-base
    font-light
    leading-normal
`;

const Li = tw("li")`
    leading-normal
    text-base
    font-light
`;

export default Specifications;
